Revit 2027 API
RenderingSettings.SetRenderingQualitySettings Method
 Change rendering quality settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRenderingQualitySettings(
	RenderingQualitySettings settings
)
Public Sub SetRenderingQualitySettings (
	settings As RenderingQualitySettings
)
public:
void SetRenderingQualitySettings(
	RenderingQualitySettings^ settings
)
member SetRenderingQualitySettings :
        settings : RenderingQualitySettings -> unit
Parameters
settings RenderingQualitySettings
 An instance of the new rendering quality settings.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace